# Генератор презентаций

Скрипт для автоматического создания PowerPoint презентаций из структурированного текста.

## Особенности

- **Организация по папкам**: Маркер `##-FOLDER-START-##` создает новую папку для группировки презентаций
- **Создание отдельных презентаций**: Каждый маркер `##-TOPIC-START-##` создает новую презентацию
- **Поддержка слайдов**: Маркер `#-SLIDE-START-#` создает новый слайд
- **Заголовки слайдов**: `TITLE::` определяет заголовок слайда
- **Блоки кода**: `[CODE_BLOCK]` и `[/CODE_BLOCK]` для форматирования кода
- **Управление маркерами**: Только явные маркеры "- " отображаются с отступом, автоматические маркеры отключены
- **Автоматическое выделение**: Слова "Цель", "Задачи", "Пример", "Задание", "Шаг" выделяются жирным
- **Стилизация**: Шрифт Calibri, кегль 14 для основного текста

## Установка

1. Убедитесь, что у вас установлен Python 3.6+
2. Клонируйте репозиторий или скачайте файлы
3. Зависимости устанавливаются автоматически при первом запуске

## Использование

### Быстрый запуск
```bash
./run_generator.sh test_content.txt
```

### Указание выходной директории
```bash
./run_generator.sh test_content.txt my_presentations
```

### Прямое использование Python
```bash
# Активируйте виртуальное окружение
source venv/bin/activate

# Запустите генератор
python presentation_generator.py input_file.txt -o output_directory
```

## Формат входного файла

```
##-FOLDER-START-##
Начальный

##-TOPIC-START-##
Практическая работа №1: Название работы
Уровень: Начальный
Модуль 1. Название модуля

#-SLIDE-START-#
TITLE:: Заголовок слайда
Содержимое слайда...

Цель: Текст цели (будет выделен жирным)
Задачи:
- Задача 1
- Задача 2

[CODE_BLOCK]
public class Example {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}
[/CODE_BLOCK]

#-SLIDE-START-#
TITLE:: Следующий слайд
Содержимое следующего слайда...
```

### Поддерживаемые маркеры

- `##-FOLDER-START-##` - создает новую папку (название указывается в следующей строке)
- `##-TOPIC-START-##` - начинает новую презентацию
- `#-SLIDE-START-#` - создает новый слайд
- `TITLE::` - заголовок слайда
- `[CODE_BLOCK]` и `[/CODE_BLOCK]` - блоки кода
- `- ` - маркер списка с отступом (только явные маркеры)

## Структура выходных файлов

Скрипт создает структуру папок и презентаций:
```
presentations/
├── Начальный/
│   ├── presentation_01_Название_работы.pptx
│   ├── presentation_02_Следующая_работа.pptx
│   └── ...
├── Базовый/
│   ├── presentation_07_Название_работы.pptx
│   └── ...
└── Продвинутый/
    ├── presentation_11_Название_работы.pptx
    └── ...
```

- Каждый маркер `##-FOLDER-START-##` создает новую папку
- Каждый маркер `##-TOPIC-START-##` создает новую презентацию в текущей папке
- Нумерация презентаций сквозная по всем папкам

## Требования к оформлению

- Шрифт: Calibri
- Размер текста: 14pt для основного содержимого
- Автоматическое выделение жирным ключевых слов ("Цель", "Задачи", "Пример", "Задание", "Шаг")
- Без автоматических маркеров списка - только явные маркеры "- " с отступом
- Специальное форматирование для блоков кода с моноширинным шрифтом
- Отступы для элементов списка

## Примеры

В файле `test_content.txt` содержатся примеры правильного форматирования для различных типов контента.

## Поддерживаемые форматы

- Входной файл: `.txt` с кодировкой UTF-8
- Выходные файлы: `.pptx` (PowerPoint презентации)