# Генератор презентаций

Скрипт для автоматического создания PowerPoint презентаций из структурированного текста.

## Особенности

- **Создание отдельных презентаций**: Каждый маркер `##-TOPIC-START-##` создает новую презентацию
- **Поддержка слайдов**: Маркер `#-SLIDE-START-#` создает новый слайд
- **Заголовки слайдов**: `TITLE::` определяет заголовок слайда
- **Блоки кода**: `[CODE_BLOCK]` и `[/CODE_BLOCK]` для форматирования кода
- **Автоматическое выделение**: Слова "Цель", "Задачи", "Пример", "Задание", "Шаг" выделяются жирным
- **Стилизация**: Шрифт Calibri, кегль 14 для основного текста

## Установка

1. Убедитесь, что у вас установлен Python 3.6+
2. Клонируйте репозиторий или скачайте файлы
3. Зависимости устанавливаются автоматически при первом запуске

## Использование

### Быстрый запуск
```bash
./run_generator.sh test_content.txt
```

### Указание выходной директории
```bash
./run_generator.sh test_content.txt my_presentations
```

### Прямое использование Python
```bash
# Активируйте виртуальное окружение
source venv/bin/activate

# Запустите генератор
python presentation_generator.py input_file.txt -o output_directory
```

## Формат входного файла

```
##-TOPIC-START-##
Практическая работа №1: Название работы
Уровень: Начальный
Модуль 1. Название модуля

#-SLIDE-START-#
TITLE:: Заголовок слайда
Содержимое слайда...

Цель: Текст цели (будет выделен жирным)
Задачи:
- Задача 1
- Задача 2

[CODE_BLOCK]
public class Example {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}
[/CODE_BLOCK]

#-SLIDE-START-#
TITLE:: Следующий слайд
Содержимое следующего слайда...
```

## Структура выходных файлов

Скрипт создает отдельную презентацию для каждого маркера `##-TOPIC-START-##`:
- `presentation_01_Название_работы.pptx`
- `presentation_02_Следующая_работа.pptx`
- и т.д.

## Требования к оформлению

- Шрифт: Calibri
- Размер текста: 14pt для основного содержимого
- Автоматическое выделение жирным ключевых слов
- Без автоматических маркеров списка
- Специальное форматирование для блоков кода

## Примеры

В файле `test_content.txt` содержатся примеры правильного форматирования для различных типов контента.

## Поддерживаемые форматы

- Входной файл: `.txt` с кодировкой UTF-8
- Выходные файлы: `.pptx` (PowerPoint презентации)